export const headerSlider = [
  '1.	نصیب ضرور ملے گا، تم کمائی کے عمدہ ذرائع اختیار کرو		رسول اللہ ﷺنے فرمایا: ’جبرائیل  نے میرے دل میں وحی کی کہ کوئی شخص اپنا رزق اور عمر پوری کیے بغیر دنیا سے نہ جائے گا، لہٰذا تم حصولِ رزق کے عمدہ ذرائع اختیار کرو اور رزق  ملنے میں تاخیر  ہونے پر اللہ کی نافرمانی  کر کے رزق  کمانے  کے بارے میں نہ سوچو ۔  یاد رکھو!  اللہ تعالیٰ کی نافرمانی سے اس کی نعمتیں حاصل نہیں کی جا سکتیں۔ ‘‘ (معجم الکبیر للطبرانی:7694، بروایت: سیدنا ابو امامہ )',
  '2.	پرندوں کی طرح رزق پانے کا سلیقہ		رسول اللہ ﷺنے فرمایا: ’’ اگر تم اللہ تعالیٰ پر  کما حقہ توکّل کرو تو تمہیں  یوں  رزق ملے، جیسے پرندوں کو ملتا ہے ، وہ صبح خالی پیٹ گھونسلوں سے نکلتے ہیں اور شام کو  پیٹ بھر کر لوٹتے ہیں۔ ‘‘ (جامع ترمذی:2344، بروایت: سیدنا عمر بن الخطاب )',
  '3.	طاقت پر ناز کیسا، ممکن ہے تمہارا رزق کمزوروں کی وجہ سے ہو 	رسول اللہ ﷺ کے زمانے میں دوبھائی تھے، ایک دین سیکھنے کے لیے رسول اللہ ﷺ کی خدمت میں حاضر رہتا اور دوسرا محنت مزدوری کرتا، ایک دن محنت  مزدوری کرنے والے نے اپنے بھائی کے (دین سیکھنے اور کام نہ کرنے کی) شکایت کی تو رسول اللہﷺ نے فرمایا:’’ عین ممکن ہے  کہ تجھے اسی کی وجہ سے رزق ملتا ہو۔‘‘ (جامع ترمذی:2345، بروایت: سیدنا انس )',
  '4.	تم بُری سمجھتے ہو، حالانکہ اچھی چیزیں ہیں یہ!	رسول اللہ ﷺ نے  فرمایا: ’’ آدم  کا بیٹا دو  (اچھی) چیزوں کو ناپسند جانتا ہے ۔یہ  موت  کو ناپسند کرتا ہے، حالانکہ مؤمن کے لیے فتنے میں پڑ جانے سے موت بہتر ہے اور فرزندِ آدم  مال کی کمی سے ڈرتا ہے، حالانکہ کم مال  کا مطلب ہے کم حساب ۔‘‘  (مسند احمد،حدیث نمبر:23625، براویت: سیدنا محمود بن لبید  )',
  '5.	موت سے بڑھ کر تعاقب میں  ہے لگی  ہوئی  چیز		رسول اللہ ﷺنے فرمایا: ’’ موت سے بھی بڑھ کر رزق انسان کی تلاش میں رہتا ہے۔‘‘ (صحیح الجامع:355، بروایت: سیدنا ابوالدرداء )',
  '6.	ہاتھ کی کمائی سے بڑھ کر کوئی کمائی نہیں!		رسول اللہ ﷺنے فرمایا: ’’ اپنے ہاتھوں سے کمائی  ہوئی روزی سے بڑھ کر عمدہ روزی کسی نےنہیں کھائی اور اللہ کے نبی داؤد بھی اپنے ہاتھ سے کمائی  ہوئی روزی کھایا کرتے تھے۔‘‘ (صحیح بخاری:2072، بروایت : سیدنا مقدام )',
  '7.	محنت کرو، آسمان سے سونا نہیں برستا!	سیدنا عمرفاروق  کا فرمان  ہے : ’’رزق کی تلاش میں سستی نہ برتو کہ بیٹھے بیٹھے کہنے لگو: ’’اے اللہ مجھے رزق عطا فرما!‘‘ تم بخوبی جانتے ہو کہ (رزق کا وسیلہ کوشش ہے) آسمان سے سونا اور چاندی نہیں برستے۔‘‘ (موسوعۃ الألبانی فی العقیدہ:9؍595)',
  '8.	محنت کے لیے کوئی پیشہ عیب نہیں	رسول اللہ ﷺنے فرمایا: ’’زکریا  بڑھئی تھے۔‘‘ (صحیح مسلم:2379، بروایت: سیدنا ابوہریرہ )',
  '9.	نبیٔ رحمت نے بھی مزدوری کی!	رسول اللہ ﷺنے فرمایا: ’’اللہ  تعالیٰ نے جو نبی بھی مبعوث فرمایا، اس نے بکریاں چرائیں۔‘‘ صحابہ  نے دریافت کیا: ’’یا رسول اللہ! کیا آپ نے بھی بکریاں چرائی ہیں؟ ‘‘ آپ ﷺنے فرمایا: ’’ہاں! چند قیراط کی مزدوری پر میں نے بھی  مکہ والوں کی بکریاں چرائیں ۔‘‘ (صحیح بخاری:2262، بروایت: سیدنا  ابوہریرہ )',
  '10.	اجرت دینے میں دیر نہ کرو		رسول اللہ ﷺنے فرمایا: ’’ مزدور کا پسینہ خشک ہونے سے پہلے پہلے اس کی مزدوری ادا کر دو۔‘‘ (سنن ابن ماجہ:2443، بروایت: سیدنا عبداللہ بن عمر )',

  '11.	تین باتوں پر اللہ کے رسول نے قسم کھائی	رسول اللہﷺ نے فرمایا: ’’تین باتوں پر میں اللہ کی قسم کھاتا ہوں: (1) صدقہ دینے سے آدمی کا مال   کبھی کم نہیں ہوتا۔ 	(2) اپنے اوپر ہونے والے ظلم پر اگر کوئی شخص صبر کر لے تو اللہ تعالیٰ اس کی عزت میں اضافہ فرما دیتا ہے۔	(3) جو آدمی لوگوں کے سامنے  ہاتھ پھیلانے لگے، اللہ تعالیٰ اس پر غربت کا دروازہ  کھول دیتا ہے۔‘‘  (جامع ترمذی:2325، بروایت: سیدنا ابو کبشہ انماری )',
  '12.	سب سے بڑا عابد اور سب سے بڑا غنی بننے کے گُر 	رسول اللہ نے فرمایا:’’ حرام امور سے بچ  جاؤ ، تم سب سے بڑے عبادت گزار بن جاؤ گے،اللہ تعالیٰ کی تقسیم (عطاکردہ رزق) پر راضی ہو جاؤ تم سب سے زیادہ غنی ہوجاؤ گے ۔ جو کچھ تم اپنے لئے پسند کرتے ہو دوسروں کےلئے بھی وہی چاہو، تم اچھے مسلمان بن جاؤ گے اور زیادہ مت ہنسا کروکیونکہ زیادہ ہنسنا دل کو مردہ کر دیتا ہے۔‘‘  (جامع ترمذی :2305،بروایت سیدنا ابوہریرہ  )',
  '13.	وہم وگمان سے بڑھ کر رزق!	رسول اللہﷺ نے فرمایا: ’’ جو شخص استغفار کرنا معمول بنا لے، اللہ تعالیٰ اسے ہر مشکل سے نکلنے کی راہ  سجھا دیتا ہے، اس کے ہر غم کا ازالہ فرما دیتا ہے  اور اسے وہاں سے رزق مہیا فرمادیتا ہے کہ جہاں سے اسے وہم و گمان بھی نہ ہو ۔‘‘ (سنن ابو داؤد: 1518، براویت: ابن عباس  )',
  '14.	لوگوں کے خلاف خود خدا مدعی ہو گا!	رسول اللہ ﷺنے فرمایا، اللہ تعالیٰ فرماتا ہے: ’’ تین لوگوں کے خلاف، قیامت کے دن میں خود مدعی بنوں گا :  (1) جو میرے نام پر عہد کر کے وعدہ خلافی کرے ۔	(2)  جو کسی آزاد کو  بیچ کھائے۔	(3) اور جو ملازم سے کام پورا لے  کر بھی اجرت پوری نہ دے۔‘‘ (صحیح بخاری:2227، بروایت: سیدنا ابوہریرہ )',
  '15.	دیکھنا کہیں مال وبال نہ بن جائے	رسول اللہ ﷺ نے فرمایا: ’’ مجھے اندیشہ ہے کہ میرے بعد تم پر دنیا کی فراخی اور زیب وزینت کے دروازے کھول دیئے جائیں گے۔‘‘ ایک شخص نے عرض کی:اللہ کے رسول اللہ ﷺ ! کیا اچھی چیز سے بھی برائی  کا اندیشہ ہے؟آپ کچھ دیر  خاموش رہے ۔پھر  آپ پر وحی نازل ہونے لگی۔ بعد ازاں  آپ نے چہرۂ مبارک سے پسینہ صاف کیا اور تحسینی انداز  میں  دریافت فرمایا:’’ سائل کہاں ہے؟ پھر فرمایا:’’ بات یہ ہے کہ اچھی چیز تو برائی پیدا نہیں کرتی لیکن موسمِ بہار میں گھاس  کی ایسی کثرت ہو جاتی ہے کہ   (زیادہ کھانے کی وجہ سے)  جانور کو جو  مار ڈالتی ہے یا بیمار کردیتی ہے سوائے اس سبزہ خورجانور کے کہ  جو اتنا  ہی کھائے کہ اس کی دونوں کو کھیں بھر جائیں  اور پھر  وہ دھوپ میں جا بیٹھے اور (جب ہضم کر کے) پیشاب کرلے، تو دوبارہ چرنے لگے، بلا شبہ یہ مال سر سبز اور میٹھا ہے ، یہ مال تو بس مسلمان ہی کا اچھا ساتھی ہے، وہ مسلمان کہ جو اس سے مسکینوں، یتیموں اورمسافروں  کو بھی ان کا حق دے اور فرمایا:’’ ناحق مال لینے والا اس شخص کی طرح ہے جو کھاتا جائےمگراس کا پیٹ نہ  بھرے،ایسا مال قیامت کے دن اس کے خلاف گواہی دے گا۔‘‘ (صحيح بخاری:1465، براویت: سیدنا ابو سعید خدری  )',
];

export const footerNav = [
  {
    name: 'SHOWS',
    nav: [
      {
        name: 'Ahkam o Masail',
        link: '/category/ahkamomasail',
      },
      {
        name: 'Subh e Watan',
        link: '/category/subhe-watan',
      },
      {
        name: 'Tafseer Ul Quran',
        link: '/category/tafseer-ul-quran',
      },
      {
        name: 'Paigham e Pakistan',
        link: '/category/paigham-e-pakistan',
      },
    ],
  },

  {
    name: 'Scholars',
    nav: [
      {
        name: 'Qari Sohaib Ahemd',
        link: '/qari-sohaib-ahemd-meer-muhammadi?id=2712',
      },
      {
        name: 'Dr Hammad Lakhvi',
        link: '/dr-hammad-lakhvi?id=220',
      },
      {
        name: 'Yousuf Siraj',
        link: '/hafiz-m-yousuf-siraj?id=1337',
      },
      {
        name: 'Abdul Malik Mujahid',
        link: '/abdul-malik-mujahid?id=2664',
      },
    ],
  },
  {
    name: 'QUICK LINKS ',
    nav: [
      {
        name: 'About Us',
        link: '/about-us',
      },

      {
        name: 'Contact',
        link: '/contact-us',
      },
      {
        name: 'TV Guide',
        link: '/program-scheduling',
      },
      {
        name: 'All Videos',
        link: '/videos',
      },
    ],
  },
  {
    name: 'TAGS',
    nav: [
      {
        name: 'Happy',
        link: '/tags/happy',
      },
      {
        name: 'Motivated',
        link: '/tags/motivated',
      },
      {
        name: 'Sad',
        link: '/tags/sad',
      },
    ],
  },
];

export const category = [
  {
    name: 'Ramadan',
    image: '/images/Ramadan.png',
  },
  {
    name: 'Islamic',
    image: '/images/Islamic.png',
  },
  {
    name: 'Sisters',
    image: '/images/Sisters.png',
  },
  {
    name: 'Quran',
    image: '/images/Quran.png',
  },
];
