
export const headerSlider = [
  {
      "hadith": "تعلیمِ قربانی ، پیارے مدنی ﷺ کی زبانی"
  },
  {
      "hadith": "قربانی کا دن، سب دنوں سے افضل ہے رسول اللہﷺ نے فرمایا: ’’اللہ تعالیٰ کے نزدیک سب دنوں میں سے افضل دن قربانی کا دن(10 ذوالحجہ) ہے اور اس کے بعد پسندیدہ دن یَوْمُ الْقَرِّ(11ذوالحجہ) ہے۔ (سنن ابوداؤد: 1765، بروایت: سیدنا عبداللہ بن قُرطْ)"
  },
  {
      "hadith": "قربانی نہ کرنے والے کو تنبیہ رسول اللہﷺنے فرمایا: ’’استطاعت کے باوجود قربانی نہ کرنے والا ہماری عید گا ہ کےقریب نہ آئے۔‘‘ (سنن ابن ماجہ :3123، بروایت: سیدنا ابو ہریرہ)"
  },
  {
      "hadith": "کس طرح کے جانور کی قربانی جائز نہیں رسول اللہﷺ نے فرمایا: ’’4 قسم کےجانوروں کی قربانی جائز نہیں: (1) ایسا کانا جانور جس کا کانا پن بالکل واضح ہو۔ (2) ایسا بیمار جانور جس کی بیماری واضح ہو۔ (3) ایسا لنگڑا جانور جس کالنگڑاپن نمایاں ہو۔ (4) ایسا لاغر اور کمزور جانور جس کی ہڈیوں میں گودا نہ ہو۔‘‘ (سنن ابوداؤد:2802، بروایت: سیدنا براء بن عازب)"
  },
  {
      "hadith": "کس عمر کا جانور قربانی کے لائق ہے؟ رسول اللہﷺ نے فرمایا: ’’2 دانت گرنے سے کم عمر جانور کی قربانی نہ کرو۔ اگر 2 دانت گرا چکنے والا جانور نہ ملے تو پھر اس سے کم عمر بھیڑ کا بچہ؍چھترا ذبح کر لو۔‘‘ (صحیح مسلم : 1963، بروایت: سیدنا جابر بن عبداللہ)"
  },
  {
      "hadith": "صحابی کو کم عمر بکری کی قربانی کی اجازت نمازِ عید سے پہلے قربانی کر بیٹھنے والے صحابی سیدنا ابو بردہ نے عرض کی کہ اب تو میرے پاس بکری کا 2 دانت سے کم عمر کا بچہ ہی ہے۔ آپﷺ نے فرمایا: ’’ایسی صورت میں تم اسی کی قربانی کر لو، تاہم کسی اور کے لیے ایسا جانور ذبح کرنا درست نہیں۔‘‘ (صحیح مسلم : 1961، بروایت: سیدنا براء بن عازب)"
  },
  {
      "hadith": "رسول اللہﷺکے قربانی کے جانور نبی کریم ﷺ کے ایک چھترا قربانی کے لیے لایا گیا، آپﷺ نے اسے اپنے ہاتھ سے ذبح فرمایا: بِسْمِ اللہِ وَاللہُ أَکْبَر ۔ (جامع ترمذی:1521، بروایت: سیدنا جابر بن عبد اللہ)"
  },
  {
      "hadith": "اونٹ اور گائے میں 7، 7 حصے سیدنا جابر بن عبد اللہ بیان فرماتے ہیں: ’’صلح حدیبیہ کے موقع پر رسول اللہﷺ کے ساتھ ہم نے اونٹ اور گائے کو سات سات آدمیوں کی طرف سے قربان کیا۔‘‘ (صحیح مسلم: 1318، بروایت: سیدنا جابر بن عبد اللہ)"
  },
  {
      "hadith": "مشکل ہو تو اونٹ میں 10 حصے سیدنا ابن عباس روایت کرتے ہیں:’’ہم رسول اللہﷺ کےساتھ سفرمیں تھے،کہ عید الاضحیٰ آ گئی، اس وقت ہم گائےکی قربانی میں 7 لوگ اور اونٹ کی قربانی میں 10 اَفراد شریک ہوئے۔‘‘ (جامع ترمذی :905، بروایت: سیدنا ابن عباس)"
  },
  {
      "hadith": "رسول اللہﷺجانور کہاں ذبح فرماتے؟ رسول اللہ ﷺ اپنی قربانی کا جانور عید گاہ میں ذبح فرمایا کرتے تھے ۔ (سنن ابوداؤد: 2811، بروایت: سیدنا عبداللہ بن عمر)"
  },
  {
      "hadith": "قربانی کرتے وقت رسول اللہﷺ کی دعا رسول اللہﷺ نے مینڈھا ذبح کرنے کیلئے لٹایا تویہ دعا پڑھی: «بِسْمِ اللہِ اَللّٰھُمَّ تَقَبَّلْ مِنْ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَمِنْ اُمَّۃِ مُحَمَّدٍ» ’’اللہ کےنام سے ذبح کرتاہوں، اے اللہ! محمد (ﷺ)،آل محمد (ﷺ) اور امت محمد (ﷺ )کی طرف سے یہ قربانی قبول فرما۔‘‘ اور پھر آپﷺ نے جانور ذبح فرمادیا۔ (صحیح مسلم: 1967، بروایت: سیدہ عائشہ)"
  },
  {
      "hadith": "رسول کریم ﷺ کے قربان کردہ جانور کا رنگ رسول کریمﷺ نے جس جانور کی قربانی فرمائی، اس کے قدم، پیٹ اور آنکھیں سیاہ تھیں۔ (صحیح مسلم: 1967، بروایت: سیدہ عائشہ)"
  },
  {
      "hadith": "قربانی کا صحیح وقت سیدنا ابوبردہ نے نمازِ عید سے پہلے ہی جانور ذبح کر دیاتو رسول اللہﷺ نے فرمایا: ’’قربانی نہیں، یہ عام ذبیحہ ہے۔‘‘ (صحیح مسلم : 1961، بروایت سیدنا براء بن عازب)"
  },
  {
      "hadith": "نماز سے پہلے کی گئی قربانی، قربانی نہیں قربانی کے دن رسول اللہﷺ نے فرمایا: ’’اس دن ہم پہلے نماز عید پڑھتے ہیں پھر قربانی کرتے ہیں، جس نے ایسے کیا، اس نے ہماری سنت کوپالیااور جس نےنماز سے پہلے ذبح کیا، تووہ قربانی نہیں، محض عام گوشت ہے۔‘‘ (صحیح مسلم : 1961، بروایت: سیدنا براء بن عازب)"
  },
  {
      "hadith": "نماز سے پہلے کی گئی قربانی کی جگہ نئی قربانی رسول اللہﷺ نے فرمایا: ’’جس نے نمازِ عید سے پہلے جانور ذبح کیا، وہ اس کی جگہ دوبارہ قربانی کرے۔‘‘ (صحیح مسلم : 1962، بروایت: سیدنا انس بن مالک)"
  },
  {
      "hadith": "جانور ذبح کرنے میں تعاون لینا رسول اللہﷺ نے قربانی کا جانور ذبح کرنےکیلئے لٹایااور ایک شخص کوجانور ذبح کرنے میں مدد دینے کےلیےبلایا اور پھر اس کےتعاون سے جانور ذبح فرمایا۔ (مسند احمد :23168)"
  },
  {
      "hadith": "عورت بھی ذبح کر سکتی ہے ایک عورت نے تیز دھار پتھر سے بکری ذبح کر دی، رسول اللہﷺسے اس بارےمیں پوچھا گیاتوآپﷺ نے اسے کھانے کی اجازت دے دی۔ (صحیح بخاری :5504، بروایت: سیدنا کعب بن مالک)"
  },
  {
      "hadith": "جانور کے پیٹ میں موجود بچے کا معاملہ رسول اللہﷺ نے فرمایا: ’’ماں کا ذبح کرنا ہی اس کے پیٹ میں موجود بچے کا ذبح کرنا ہے۔‘‘ (سنن ابوداؤد :2828، بروایت: سیدنا جابر بن عبداللہ)"
  },
  {
      "hadith": "جانور کے پیٹ میں موجود بچہ کھانا جائز ہے صحابہ کرام نے نبی کریمﷺسے دریافت کیا کہ ہم اونٹنی، گائے اوربکری ذبح کرتے ہیں توکبھی اس کےپیٹ میں بچہ موجود ہوتا ہے، ہم اسے کھالیں یاپھینک دیں؟ آپﷺ نے فرمایا: ’’چاہو تو کھا سکتے ہو اور اسے ذبح کرنے کی بھی ضرورت نہیں، اس کی ماں کا ذبح کرنا ہی اس کے لیے بھی کافی ہے۔‘‘ (سنن ابوداؤد : 2827، بروایت: سیدنا ابو سعید خدری)"
  },
  {
      "hadith": "قربانی کی کھال کا مصرف رسول اللہﷺنے فرمایا: ’’جس نے اپنی قربانی کی کھال فروخت (کر کے قیمت خود استعمال کر لی) اس کی کوئی قربانی نہیں۔‘‘ (البتہ بیچے بغیرکھال ذاتی استعمال میں لائی جا سکتی ہے، مثلًا جائے نماز یا مشکیزہ وغیرہ بنالینا۔) (سنن بیہقی: 19233، بروایت: سیدنا ابوہریر)"
  },
 
];


export const footerNav = [
  {
    name: 'SHOWS',
    nav: [
      {
        name: 'Ahkam o Masail',
        link: '/category/ahkamomasail',
      },
      {
        name: 'Subh e Watan',
        link: '/category/subhe-watan',
      },
      {
        name: 'Tafseer Ul Quran',
        link: '/category/tafseer-ul-quran',
      },
      {
        name: 'Paigham e Pakistan',
        link: '/category/paigham-e-pakistan',
      },
    ],
  },

  {
    name: 'Scholars',
    nav: [
      {
        name: 'Qari Sohaib Ahemd',
        link: '/scholars/qari-sohaib-ahemd-meer-muhammadi?id=2712',
      },
      {
        name: 'Dr Hammad Lakhvi',
        link: '/scholars/dr-hammad-lakhvi?id=220',
      },
      {
        name: 'Yousuf Siraj',
        link: '/scholars/hafiz-m-yousuf-siraj?id=1337',
      },
      {
        name: 'Abdul Malik Mujahid',
        link: '/scholars/abdul-malik-mujahid?id=2664',
      },
    ],
  },
  {
    name: 'QUICK LINKS ',
    nav: [
      {
        name: 'About Us',
        link: '/about-us',
      },

      {
        name: 'Contact',
        link: '/contact-us',
      },
      {
        name: 'TV Guide',
        link: '/program-scheduling',
      },
      {
        name: 'All Videos',
        link: '/videos',
      },
    ],
  },
  {
    name: 'TAGS',
    nav: [
      {
        name: 'Happy',
        link: '/tags/happy',
      },
      {
        name: 'Motivated',
        link: '/tags/motivated',
      },
      {
        name: 'Sad',
        link: '/tags/sad',
      },
    ],
  },
];

export const category = [
  {
    name: 'Ramadan',
    image: '/images/Ramadan.png',
  },
  {
    name: 'Islamic',
    image: '/images/Islamic.png',
  },
  {
    name: 'Sisters',
    image: '/images/Sisters.png',
  },
  {
    name: 'Quran',
    image: '/images/Quran.png',
  },
];
